Основные_объекты_Занятие_6/src/InformationRegisters/ФИОСотрудника/ФИОСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОСотрудника</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Основные_объекты_Занятие_6/src/InformationRegisters/ФИОСотрудника/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ЧастиФИО = СерверВызовСервера.ПолучитьЧастиФИО(Запись.Сотрудник);
	
	Запись.Фамилия = ЧастиФИО.Фамилия;
	Запись.Имя = ЧастиФИО.Имя;
	Запись.Отчество = ЧастиФИО.Отчество;
	
	
КонецПроцедуры
